<%@ page language="java" contentType="text/html; charset=gb2312" pageEncoding="UTF-8"
%><!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
<title>系统概述--系统功能简介</title>
<link href='help.css' rel='stylesheet' type='text/css' />
</head>
<body>

<h2>系统概述--系统功能简介</h2>

<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td valign="top">
    <table width="100%" border="0" cellspacing="0" cellpadding="0"
      style="WORD-BREAK: break-all;Width:fixed">
      <tr>
        <td height="15"></td>
      </tr>
      <tr>
        <td height="30" align="center" class="main_ArticleTitle">系统功能简介</td>
      </tr>
      <tr>
        <td align="center" class="main_ArticleSubheading"></td>
      </tr>
      <tr>
        <td height="15"></td>
      </tr>
      <tr>
        <td height="200" valign="top" id="fontzoom"
          style="WORD-BREAK: break-all;">
        <P>
        <P align=center><FONT color=#1111ff><STRONG>模块共有功能简介</STRONG></FONT>
        <P>●前台页面设计（模板）和程序完全分离。 <BR>
        ●栏目支持无限级分类，每一级支持无限个栏目。支持无限个专题。从而从最简单的网站到最复杂的网站，
        发布系统都可适用。当栏目结构或数据出现错误时，可一键自动修复栏目结构和数据。 <BR>
        ●每个栏目可以进行完善的权限设定（浏览、查看、发表等各种权限）。 <BR>
        <BR>
        ●同时支持JSP方式访问和生成HTML文件功能。首页、栏目页、内容页、专题页，都可以生成完全的HTML页面。 <BR>
        ●自定义生成HTML方式（4种方式）。 <BR>
        ●自定义栏目列表文件的存放位置（3种位置）。 <BR>
        ●自定义生成文件的目录结构（15种目录结构）。 <BR>
        ●自定义内容页的文件名方式（4种）。 <BR>
        ●自定义生成文件的扩展名（首页、栏目页、内容页、专题页各5种）。您可以随心所欲，任意选择，HTML生成
        更加灵活自如，只点几下鼠标便可轻松搞定，使您设计网站结构更加游刃有余，管理网站文件更加方便快捷。
        不仅大大提高了被各大搜索引擎收录的可能性，也使您的网站目录结构减少了与其他网站相同的机会，
        再配以个性化的美工，用户访问网站时甚至看不出您用的是哪一套系统。 <BR>
        ●非常方便的批量生成功能，可以按ID、栏目、时间、数量等批量生成指定的栏目页、内容页、专题页。 <BR>
        ●批量生成时提供了慢速生成和快速生成两种可选方式，在保证速度的前提下减轻了服务器负担。 <BR>
        ●人性化的自动生成HTML功能，在您添加文章时就自动帮您生成一切需要更新的页面。 <BR>
        ●当不使用生成HTML方式访问，而采用普通JSP访问时，全面引入服务器端缓存，减少服务器端压力，
        加快了客户端浏览速度。并且所有缓存的更新都是全自动的。当然也可以在后台手动更新缓存。 <BR>
        ●自定义字段管理，用户可以在现在数据库的基础上具有字段，以实现个性化的功能。 <BR>
        ●自定义上传目录，方便用户备份以及防止非法盗链。 <BR>
        ●全面优化优化数据库结构、查询分页算法、优化频道属性算法 <BR>
        ●增强将频道独立为子域名访问的功能，用于建立大型网站 <BR>
        ●具有同一内容可以属于多个专题的功能，具有全站专题功能 <BR>
        ●具有站内高级搜索、模糊搜索、并且可以搜索自定义字段 <BR>
        ●具有了多关键字搜索，并且搜索结果标签可以自定义 <BR>
        ●后台部分界面采用书签式管理方式 <BR>
        ●用户控制中心界面全面改进，使其与前台页面风格保持一致 <BR>
        ●具有自定义动态标签、自定义动态函数标签采集标签<BR>
        ●具有自定义页面管理功能 <BR>
        ●自定义列表具有多行多列控制，并且自定义字段可以在自定义列表中解析 <BR>
        ●图片及下载频道列表标签具有了列数控制及CSS控制 <BR>
        ●具有子栏目调用标签及专题列表标签 <BR>
        ●具有生成未生成页面的功能 <BR>
        ●提高生成速度，具有生成错误后自动跳过该文件的功能 <BR>
        ●具有定时生成功能。可以自定义生成时间、频道、栏目等 <BR>
        ●生成时显示详细的信息：第几篇文章、文章标题、文章ID、所属栏目等 <BR>
        ●增强上传文件管理及“从已上传文件中选择”功能 <BR>
        ●各个频道可以完美实现相互移动栏目或内容 <BR>
        ●可设置频道、栏目、专题的图片，可设置网站、频道和栏目的meta关键字和描述 <BR>
        ●各个频道具有JS文件设置选项的参数，保持与标签调用一致 <BR>
        ●JS文件类型提供两种选择：JS 模式、SHtml 模式<BR>
        ●可以给内容（文章、软件、图片等）设置允许查看的用户组 <BR>
        ●文章、下载、图片的审核属性改为状态属性，分别为：退稿、草稿、待审核、初审通过、二审通过、终审通过&nbsp; <BR>
        <P align=center><STRONG><FONT color=#0033ff>文章模块功能简介</FONT></STRONG></P>
        <P>●强大的HTML在线编辑器，仿Word的操作界面，使得录入文章的排版非常轻松。<BR>
        ●文章可以不属于任何栏目。<BR>
        ●支持文章简短标题、完整标题、副标题、文章简介。<BR>
        ●支持文章转向链接功能。<BR>
        ●支持作者文集功能，同时提供作者管理功能。<BR>
        ●支持文章来源管理功能。<BR>
        ●支持“相关文章”功能，同时提供关键字管理功能。<BR>
        ●支持站内链接功能。将文章内的关键字链接到预设的网址。<BR>
        ●字符替换（过滤敏感字）管理功能。可以对文章内容中出现的非法文字按站长事先指定的规则进行替换或过滤。<BR>
        ●支持超长文章内容进行自动分页或手动分页。<BR>
        ●支持文章固顶、文章推荐、文章评分等级、热门文章等功能<BR>
        ●支持前台图片文章调用、幻灯片效果调用、普通列表调用、普通表格式调用等多种调用方式。<BR>
        ●支持前台自定义列表调用。支持文章标题横向多列排列。<BR>
        ●支持文章评论功能，评论可以设定是否需要审核，后台同时提供评论管理、管理员回复等功能。<BR>
        ●支持将文章发送给好友功能。<BR>
        ●支持文章打印功能。<BR>
        ●支持将文章加入会员收藏夹功能。<BR>
        ●支持前台文章内容页的字体由浏览者自行调整功能。<BR>
        ●支持前台文章内容页的双击鼠标自动翻屏功能。<BR>
        ●支持前台文章内容页的图片自动缩小至合适大小功能。<BR>
        ●文章自动采集功能。与同类采集系统相比，发布系统的采集系统更强大，更加人性化。独有的项目导入/导出功能，能帮助您迅速扩充直接的采集项目数量，操作采集扩充资源将方便，灵活。采集过程中使用缓存技术，使的原本非常消耗系统资源的采集大大减少了资源占有量，2006的采集在减少资源占用率上的控制上，比同等采集更加优越。<BR>
        ●具有稿费支持功能。在审核文章时有一栏让主编写上“编者按”之类的评语。如果审核通过，需要填写稿费，并发送短消息，如果不采用，可以说明退稿原因，并发送短消息。<BR>
        ●在添加文章的时候检查一下文章标题是否重复<BR>
        ●在文章分页时给每页加上标题<BR>
        ●即使采用了转向连接，也要判断是否是会员，才能给他观看。<BR>
        ●给文章输出列表具有智能多列处理功能<BR>
        ●在搜索内容的同时也搜索简介，并在结果中显示文章的简介。<BR>
        ●文章内容页中的自动分页，当分页过多时，应规定显示一定的页面数，然后前后都有个翻页。<BR>
        ●改进文章签收功能，分专属文章和公用文章。专属文章在前台无法看到，只能在用户后台看，在需要签收的文章后加个需要签收的提示。</P>
        <P align=center><STRONG><FONT color=#1111ff>下载模块功能简介</FONT></STRONG></P>
        <P>●软件可以不属于任何栏目。<BR>
        ●支持软件名称、软件版本、软件简介、开发商、来源、软件类别、软件语言、授权形式、运行平台、软件缩略图、解压密码。<BR>
        ●每个软件支持无限多个下载地址。<BR>
        ●软件类别、授权形式、运行平台等项目的内容用户可以自由设定。<BR>
        ●支持作者软件集功能，同时提供作者管理功能。<BR>
        ●支持软件来源管理功能。<BR>
        ●支持“相关软件”功能，同时提供关键字管理功能。<BR>
        ●支持站内链接功能。可将下载内的关键字链接到预设的网址。<BR>
        ●字符替换（过滤敏感字）管理功能。可以对下载内容中出现的非法文字按站长事先指定的规则进行替换或过滤。<BR>
        ●支持软件的固顶、推荐、评分等级、热门下载等功能。<BR>
        ●支持前台图片调用、幻灯片效果调用、普通列表调用、普通表格式调用等多种调用方式。<BR>
        ●支持前台自定义列表调用。<BR>
        ●支持评论功能，评论可以设定是否需要审核，后台同时提供评论管理、管理员回复等功能。<BR>
        ●支持简单的防盗链功能。<BR>
        ●软件属性具有浏览量的记数<BR>
        <P align=center><FONT color=#1111ff><STRONG>图片模块功能简介</STRONG></FONT></P>
        ●提供添加方式：添加图片。<BR>
        简洁和高级模式用于添加某张图的图集，如某次车展中的某个模特的所有相关照片。<BR>
        ●图片可以不属于任何栏目。<BR>
        ●支持图片名称、图片作者、图片来源、图片简介。<BR>
        ●每张缩略图可以附带无数个大图地址，以实现图集功能。<BR>
        ●点击查个某个图集中的某张图片后，再查看此图集中的其他图片时，不需多次查询数据库。极大的减轻了服务器的压力。<BR>
        ●查看图片时，提供放大、缩小、以原始大小查看、以最合适大小查看、全屏查看等功能。<BR>
        ●支持作者图集功能，同时提供作者管理功能。<BR>
        ●支持图片来源管理功能<BR>
        ●支持“相关图片”功能，同时提供关键字管理功能。<BR>
        ●支持站内链接功能。可将图片内的关键字链接到预设的网址。<BR>
        ●字符替换（过滤敏感字）管理功能。可以对图片内容中出现的非法文字按站长事先指定的规则进行替换或过滤。<BR>
        ●支持图片固顶、图片推荐、图片评分等级、热门图片等功能。<BR>
        ●支持前台图片调用、幻灯片效果调用、普通列表调用、普通表格式调用等多种调用方式。<BR>
        ●支持评论功能，评论可以设定是否需要审核，后台同时提供评论管理、管理员回复等功能。<BR>
        ●支持将图片加入会员收藏夹功能。<BR>
        ●图片等比例自适应大小。<BR>
        ●去掉了图片边框滚动条。<BR>
        ●具有了可设置时间的“幻灯播放”效果。
        <P></P>
        <P align=center><FONT color=#1111ff><STRONG>通用模块功能简介</STRONG></FONT></P>
        <P><STRONG>1、在线HTML编辑器模块</STRONG><BR>
        ●在线编HTML辑器具有强大的图文混排功能。<BR>
        ●文字可自由设定颜色、段落格式、缩进量、文字上下标等格式，并可方便地删除文字格式。<BR>
        ●可自动识别各种网址和Email地址，可具有或取消链接。<BR>
        ●插入特殊水平线等功能。<BR>
        ●支持从word中粘贴内容并去除冗余代码。<BR>
        ●可以在文档的任意位置插入图片及表格。<BR>
        ●可直接复制网上的图片，并自动保存到网站中。<BR>
        ●可以在插入图片时指定图片的URL地址、图片大小、图片css效果、对齐方式、边框粗细等。<BR>
        ●可以批量上传图片，最多可以同时上传10张图片，并可预览图片效果。<BR>
        ●可上传本地图片、附件等，上传后会直接显示出来。<BR>
        ●可以直接从已上传的文件中选择。<BR>
        ●插入表格时可指定各项参数，即时显示出效果并进行修改。<BR>
        ●可插入flash多媒体、视频文件和Realplay文件，并使其能在网页中即时播放。<BR>
        ●支持插入栏目框和插入网页的功能。<BR>
        ●便捷的右键编辑功能，可进行常规的复制、粘贴，也可对表格进行合并、插入和修改等操作。<BR>
        ●提供“编辑”、“源代码”、“预览”和“文本”四种视图模式，可扩大或缩小编辑区。<BR>
        ●右键具有调用分页标签及广告JS的功能<BR>
        ●编辑器中添加的HTML代码内容，在修改时不会进行自动转化，会保持原状态（修复2005版存在的问题）<BR>
        <STRONG>2、网站信息配置模块<BR>
        </STRONG>●网站信息配置：网站名称、网站标题、网站地址、Logo地址、Banner地址、站长姓名、版权信息等。<BR>
        ●网站选项配置：各项有关网站通用的选项。<BR>
        ●会员选项：是否允许新会员注册，新会员注册是否需要邮件验证或管理员认证，禁止注册的用户名，注册必填项目，赠送的点数或有效期，会员资金与点券兑换比率、积分与点券兑换比率。<BR>
        ●邮件服务器选项：邮件发送组件、SMTP服务器地址、SMTP登录用户名、SMTP登录密码、SMTP域名。<BR>
        ●缩略图选项：生成缩略图组件，图片添加水印文字，水印文字字体，水印文字大小，水印文字颜色，水印文字坐标位置，缩略图默认宽度，缩略图默认高度，缩略图算法。<BR>
        ●搜索选项：每次搜索时间间隔，搜索返回最多的结果数，是否启用全文搜索。<BR>
        ●商城选项：是否允许游客购买商品，商品价格是否含税，税率设置，在线支付平台，商户编号，MD5私钥，手续费率，订单编号前缀，在线支付单编号前缀。<BR>
        ●RSS选项：网站是否启用RSS功能，Rss使用编码。<BR>
        ●WAP选项：网站是否启用WAP(手机访问）功能，WAP浏览LOGO，是否启用评论功能，是否启用附件显示，是否启用手机商城，是否启用WAP进行后台管理。<BR>
        ●上传文件时，根据文件扩展名判断显示“缩略图大小”的选项。<BR>
        ●采集文章时，图片也能生成缩略图。<BR>
        ●具有给远程图片添加水印，给第一张图片具有缩略图功能。<BR>
        ●具有图片水印。<BR>
        <STRONG>3、频道管理模块<BR>
        </STRONG>●频道的添加、管理、排序功能。<BR>
        ●支持三种频道类型：系统频道，内部频道，外部频道。<BR>
        ●自动创建内部频道的频道目录及相应文件，升级时可以方便的同步各个同类频道的JSP程序。<BR>
        ●支持将频道的目录做为一个独立子站点来访问。<BR>
        ●自定义各频道的频道名称、项目名称、项目单位名称等属性。<BR>
        ●自定义各频道生成文件的生成方式、目录结构（15种）、命名方式等。<BR>
        ●自定义各频道的上传目录、上传文件类型、上传文件大小等。<BR>
        ●自定义顶部栏目的菜单样式、底部栏目导航的样式。<BR>
        ●更多频道的设置选项。<BR>
        <STRONG>4、广告管理模块</STRONG><BR>
        ●广告版位与广告位管理。<BR>
        ●广告JS模块管理。<BR>
        ●提供6种广告版位类型：矩形横幅、弹出窗口、随屏移动、固定位置、漂浮移动和文字代码<BR>
        ●提供5种广告类型：图片、动画、文本、代码、页面。<BR>
        ●同一广告可以属于不同的版位，同一版位可以包含多个广告，并可根据广告权重及设定显示方式来随机或优先显示广告。<BR>
        ●广告生成全部采用静态JS方式，方便广告的更新并提高广告的浏览速度。<BR>
        ●支持广告统计功能，以方便了解广告的投放效果。<BR>
        ●可以自定义版位的大小、显示方式、状态等各种参数。<BR>
        ●可以自定义广告的各种参数。<BR>
        ●提供广告位的导入、导出功能。<BR>
        ●广告和广告版位具有复制功能。<BR>
        ●具有公告列表功能，提供显示全部公告的链接及页面。<BR>
        ●公告具有“有效期”的选项，有效期过后自动不显示。<BR>
        <STRONG>5、公告管理模块</STRONG><BR>
        ●支持弹出、滚动、全部三种公告类型。<BR>
        ●公告内容编辑采用HTML编辑器。<BR>
        ●支持频道通用公告、首页公告及各频道的独立公告。<BR>
        <STRONG>6、友情链接管理模块</STRONG><BR>
        ●支持文字链接、LOGO链接两种友情链接方式。<BR>
        ●友情链接可以分类，支持无限多个分类。<BR>
        ●友情链接可以分专题，支持无限多个专题。<BR>
        ●全面引入服务器端缓存，减少服务器端压力，加快了客户端浏览速度。<BR>
        <STRONG>7、网站调查模块<BR>
        </STRONG>●支持单项选择调查和多项选择调查两种调查方式。<BR>
        ●每个调查问题支持最多8个项目。<BR>
        ●支持频道通用调查、首页调查及各频道的独立调查。<BR>
        <STRONG>8、模板管理模块<BR>
        </STRONG>●人性化的模板设计界面，使设计模板时变得轻松自如。<BR>
        可视化的直观效果，提供三种编辑模式：代码模式、编辑模式、混合模式，三种模式间可以任意切换，并保持代码同步。<BR>
        具有全屏功能，更加方便使用者的操作。<BR>
        具有智能效果的代码修正功能，不规范的代码经过编辑器的智能化修正后变得非常规范和整洁。<BR>
        强大的右键标签库，让您不再需要掌握每个函数标签的参数设置，一切都更简单，更容易，您只需在编辑模式下，在您想插入标签的地方，单击鼠标右键，然后选择要插入的标签即可。<BR>
        ●可以指定频道导入模板，各频道间可以复制模板。解决了在添加频道较多情况下不能单独导入模板的问题，使各频道的风格更加多样化。<BR>
        ●异常灵活的自定义标签功能，更方便设计制作模板，并且可以在以后只需通过修改自定义标签的内容就可以达到批量修改所有模板的效果。<BR>
        ●自定义标签支持嵌套使用，更加强大和灵活。<BR>
        可以在后台自定义所要调用的标签，标签名支持英文名和中文名（英文要注意大小写，以“MY_”开头）。在模板中调用标签时要加上定界符，（如“{$MY_top}”、“{$顶部标签}”）。自定义标签时系统支持标签嵌套。自定义标签数字越小，优先级越高。当标签中再嵌套调用其他标签时，就需要决定标签的优先级。系统按照如下顺序来替换标签：自定义标签-&gt;系统通用标签-&gt;频道标签。<BR>
        <STRONG>9、文件上传模块</STRONG><BR>
        全新开发的上传组件，参考了国内外众多上传组件及上传类，充分考虑了目前流行的各种上传漏洞和攻击手段，使得发布系统上传组件无论是在安全性还是执行效率上，都明显优于其他上传类或组件。与发布系统内容管理系统无缝集成，实现了各种权限的严格判断。支持图像处理组件JSPJpeg，上传图片时可自动创建缩略图和添加水印。<BR>
        <STRONG>10、其他功能</STRONG><BR>
        ●全面引入服务器端缓存，减少服务器端压力，加快了客户端浏览速度。<BR>
        ●将导入导出的数据库统一放在Temp临时目录中去<BR>
        ●网站配置中具有后台使用模块管理功能<BR>
        ●具有整站热点内容点击数控制<BR>
        ●各频道图片列表标签的链接更改为按照栏目设置打开新窗口<BR>
        ●批量设置时，可以选择全部栏目，可以批量修改自定义字段<BR>
        ●将原来放在语言包中的一些参数放到数据库中控制<BR>
        ●具有一种新的文件名方式：更新时间＋ID<BR>
        ●后台管理路径admin可以更改<BR>
        ●后台网站配置中具有模块显示管理选项<BR>
        ●增强DW标签插件的功能<BR>
        ●评论具有网站首页调用功能<BR>
        </td>
      </tr>
      <tr>
        <td height="15"></td>
      </tr>
    </table>
    </td>
  </tr>
</table>

</body>
</html>
